soapxml/SoapRequestToErpService.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetPriceByProductID xmlns="http://tempuri.org/">
      <strAuthen>werwerewrw32423!@4#123</strAuthen>
      <objResultMessage>
        <IsError>false</IsError>
        <ErrorType>LoadInfo</ErrorType>
        <Message>string</Message>
        <MessageDetail>string</MessageDetail>
        <ErrorCode>0</ErrorCode>
        <Parram>string</Parram>
      </objResultMessage>
      <intPriceAreaID>13</intPriceAreaID>
      <strProductID>1000015004315</strProductID>
      <intOutputTypeID>0</intOutputTypeID>
      <intCompanyID>1</intCompanyID>
    </GetPriceByProductID>
  </soap:Body>
</soap:Envelope>